Revit 2024 API
BuiltInFailures.MEPFabricationFailures.FabDbOpenJobConn Property
 Fabrication job imported had bad connectivity
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static FailureDefinitionId FabDbOpenJobConn { get; }
Visual Basic
Public Shared ReadOnly Property FabDbOpenJobConn As FailureDefinitionId
	Get
Visual C++
public:
static property FailureDefinitionId^ FabDbOpenJobConn {
	FailureDefinitionId^ get ();
}
See Also
BuiltInFailures.MEPFabricationFailures Class
Autodesk.Revit.DB Namespace